In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import math

In [77]:
df = pd.read_csv('real.csv',index_col=0)

weighted rating (WR) = (v ÷ (v+m)) × R + (m ÷ (v+m)) × C

In [78]:
df = df.iloc[0:,0:3]
df

                        Store                        User  Rating
0     NAP's Coffee & Roasters                   Nuunet D.       5
1     NAP's Coffee & Roasters                   vanai sun       3
2     NAP's Coffee & Roasters              Phonanan Seeon       5
3     NAP's Coffee & Roasters  Chavakorn Laophetsakunchai       5
4     NAP's Coffee & Roasters               community man       5
...                       ...                         ...     ...
3348             Yuanjai Cafe          อาจณรงค์ กลมเกลียว       5
3349             Yuanjai Cafe                          은하       5
3350             Yuanjai Cafe              ประจงจิต จันทป       5
3351             Yuanjai Cafe          Chatthawat Warnjai       5
3352             Yuanjai Cafe                 TAE.SIRIWAT       5

[3327 rows x 3 columns]

In [79]:
av = df.groupby('Store')['Rating'].mean().reset_index(name="mean") ## C

In [80]:
C = df.groupby(["Store"])["User"].count().reset_index(name="count") ## quantile

In [81]:
df2= C.merge(av,on='Store')

In [82]:
df2.head()

                      Store  count      mean
0  11.11 Gallery and Coffee     26  4.653846
1      Abe Specialty Coffee     14  4.785714
2                    Amarna     45  4.733333
3             Anna Roasters    233  4.592275
4                 Attaroast     37  4.837838

In [69]:
C = df2['mean'].mean()
C

4.562345387938692

In [70]:
m = df2['count'].quantile(0.5)
m

66.0

In [71]:
listA = df2.copy().loc[df2['count'] >= m]
listA.shape

(17, 3)

weighted rating (WR) = (v ÷ (v+m)) × R + (m ÷ (v+m)) × C

In [72]:
def weighted_rating(x, m=m, C=C):
    v = x['count']
    R = x['mean']
    return (v/(v+m) * R) + (m/(m+v) * C)

In [73]:
listA['score'] = listA.apply(weighted_rating, axis=1)

In [74]:
listA = listA.sort_values('score', ascending=False)

#Print the top 15 movies
listA[['Store', 'score']]

                       Store     score
11          GODFATHER COFFEE  4.657145
27             Snoopcat Cafe  4.636511
17   NAP's Coffee & Roasters  4.623421
25                Saereesook  4.603101
3              Anna Roasters  4.585668
14             LIFE Roasters  4.557990
12        Impression Sunrise  4.537184
6         BalconyKiss Coffee  4.533240
18               Nap x Warin  4.530162
29              Stufe coffee  4.519086
22               ROOF COFFEE  4.488133
16                My Papilio  4.418530
10  Commune Drink/Talk/Share  4.394519
9                 Bossa cafe  4.394519
8               Blues Coffee  4.358183
20            Phantae Coffee  4.325147
30        Tree Cafe Rim Moon  4.284433

In [75]:
df

                        Store                        User  Rating
0     NAP's Coffee & Roasters                   Nuunet D.       5
1     NAP's Coffee & Roasters                   vanai sun       3
2     NAP's Coffee & Roasters              Phonanan Seeon       5
3     NAP's Coffee & Roasters  Chavakorn Laophetsakunchai       5
4     NAP's Coffee & Roasters               community man       5
...                       ...                         ...     ...
3348             Yuanjai Cafe          อาจณรงค์ กลมเกลียว       5
3349             Yuanjai Cafe                          은하       5
3350             Yuanjai Cafe              ประจงจิต จันทป       5
3351             Yuanjai Cafe          Chatthawat Warnjai       5
3352             Yuanjai Cafe                 TAE.SIRIWAT       5

[3327 rows x 3 columns]

In [76]:
df.groupby(['Store','Rating']).Rating.count().to_frame('count').reset_index()

                        Store  Rating  count
0    11.11 Gallery and Coffee       3      1
1    11.11 Gallery and Coffee       4      7
2    11.11 Gallery and Coffee       5     18
3        Abe Specialty Coffee       4      3
4        Abe Specialty Coffee       5     11
..                        ...     ...    ...
123                 r o u n d       4      3
124                 r o u n d       5      6
125                    sangob       3      3
126                    sangob       4     13
127                    sangob       5     41

[128 rows x 3 columns]

https://stackoverflow.com/questions/1411199/what-is-a-better-way-to-sort-by-a-5-star-rating

Evan Miller shows

In [16]:
def starsort(ns):
    
    """
    
    
    http://www.evanmiller.org/ranking-items-with-star-ratings.html
    
    
    """
    
    N = sum(ns)
    K = len(ns)
    s = list(range(K,0,-1))
    print(s)
    s2 = [sk**2 for sk in s]
    z = 1.65
    def f(s, ns):
        N = sum(ns)
        K = len(ns)
        return sum(sk*(nk+1) for sk, nk in zip(s,ns)) / (N+K)
    fsns = f(s, ns)
    return fsns - z*math.sqrt((f(s2, ns)- fsns**2)/(N+K+1))

In [17]:
x = (1, 0, 0,0,0)
starsort(x)

[5, 4, 3, 2, 1]

2.4036636531319653

In [48]:
import pymongo

In [49]:
client = MongoClient('localhost',27017)

In [50]:
db = client['data']

In [51]:
col = db['rating']

In [52]:
z = list(col.find({},{'_id':0,'User':0}))

In [53]:
df = pd.DataFrame(z)

In [54]:
df

                        Store Rating
0     NAP's Coffee & Roasters      5
1     NAP's Coffee & Roasters      3
2     NAP's Coffee & Roasters      5
3     NAP's Coffee & Roasters      5
4     NAP's Coffee & Roasters      5
...                       ...    ...
3322             Yuanjai Cafe      5
3323             Yuanjai Cafe      5
3324             Yuanjai Cafe      5
3325             Yuanjai Cafe      5
3326             Yuanjai Cafe      5

[3327 rows x 2 columns]

In [83]:
col2 = db['comment']

In [84]:
col2.insert_many(listA.to_dict('records'))

In [85]:
data1 = listA.to_dict('records')

In [86]:
col2.collections.insert_many(data1)